
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.30+48 (git sha1 14d50a176, clang 10.0.0-4ubuntu1 -fPIC -Os)

echo on

yosys> read_verilog -sv inputs/Stack_LIFO.v

1. Executing Verilog-2005 frontend: inputs/Stack_LIFO.v
Parsing SystemVerilog input from `inputs/Stack_LIFO.v' to AST representation.
Generating RTLIL representation for module `\Stack_LIFO'.
Warning: Replacing memory \stack with list of registers. See inputs/Stack_LIFO.v:46, inputs/Stack_LIFO.v:41
Successfully finished Verilog frontend.

yosys> chparam -list
Stack_LIFO:
  WIDTH
  DEPTH

yosys> read_liberty -lib /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_logiclib_sky130hd.lib

2. Executing Liberty frontend: /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_logiclib_sky130hd.lib
Imported 428 cell types from liberty file.

yosys> hierarchy -top Stack_LIFO

3. Executing HIERARCHY pass (managing design hierarchy).

3.1. Analyzing design hierarchy..
Top module:  \Stack_LIFO

3.2. Analyzing design hierarchy..
Top module:  \Stack_LIFO
Removed 0 unused modules.

yosys> synth -flatten -top Stack_LIFO -run begin:fine

4. Executing SYNTH pass.

yosys> hierarchy -check -top Stack_LIFO

4.1. Executing HIERARCHY pass (managing design hierarchy).

4.1.1. Analyzing design hierarchy..
Top module:  \Stack_LIFO

4.1.2. Analyzing design hierarchy..
Top module:  \Stack_LIFO
Removed 0 unused modules.

yosys> proc

4.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

4.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

4.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed 2 dead cases from process $proc$inputs/Stack_LIFO.v:37$10 in module Stack_LIFO.
Marked 4 switch rules as full_case in process $proc$inputs/Stack_LIFO.v:37$10 in module Stack_LIFO.
Marked 1 switch rules as full_case in process $proc$inputs/Stack_LIFO.v:20$3 in module Stack_LIFO.
Removed a total of 2 dead cases.

yosys> proc_prune

4.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 2 redundant assignments.
Promoted 14 assignments to connections.

yosys> proc_init

4.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

4.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

4.2.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.
<suppressed ~5 debug messages>

yosys> proc_mux

4.2.7. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
     1/27: $3$mem2reg_rd$\stack$inputs/Stack_LIFO.v:46$2_DATA[7:0]$23
     2/27: $2\next_index[7:0]
     3/27: $2\next_dout[7:0]
     4/27: $2$mem2reg_rd$\stack$inputs/Stack_LIFO.v:46$2_DATA[7:0]$21
     5/27: $2$mem2reg_rd$\stack$inputs/Stack_LIFO.v:46$2_ADDR[2:0]$20
     6/27: $2\stack[0][7:0]
     7/27: $2\stack[7][7:0]
     8/27: $2\stack[6][7:0]
     9/27: $2\stack[5][7:0]
    10/27: $2\stack[4][7:0]
    11/27: $2\stack[3][7:0]
    12/27: $2\stack[2][7:0]
    13/27: $2\stack[1][7:0]
    14/27: $1\next_index[7:0]
    15/27: $1\stack[7][7:0]
    16/27: $1\stack[6][7:0]
    17/27: $1\stack[5][7:0]
    18/27: $1\stack[4][7:0]
    19/27: $1\stack[3][7:0]
    20/27: $1\stack[2][7:0]
    21/27: $1\stack[1][7:0]
    22/27: $1\stack[0][7:0]
    23/27: $1$mem2reg_wr$\stack$inputs/Stack_LIFO.v:41$1_ADDR[2:0]$15
    24/27: $1$mem2reg_wr$\stack$inputs/Stack_LIFO.v:41$1_DATA[7:0]$16
    25/27: $1$mem2reg_rd$\stack$inputs/Stack_LIFO.v:46$2_DATA[7:0]$18
    26/27: $1$mem2reg_rd$\stack$inputs/Stack_LIFO.v:46$2_ADDR[2:0]$17
    27/27: $1\next_dout[7:0]
Creating decoders for process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:20$3'.
     1/2: $0\index[7:0]
     2/2: $0\dout[7:0]

yosys> proc_dlatch

4.2.8. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `\Stack_LIFO.\next_index' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
No latch inferred for signal `\Stack_LIFO.$mem2reg_wr$\stack$inputs/Stack_LIFO.v:41$1_ADDR' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
No latch inferred for signal `\Stack_LIFO.$mem2reg_wr$\stack$inputs/Stack_LIFO.v:41$1_DATA' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
No latch inferred for signal `\Stack_LIFO.$mem2reg_rd$\stack$inputs/Stack_LIFO.v:46$2_ADDR' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
No latch inferred for signal `\Stack_LIFO.$mem2reg_rd$\stack$inputs/Stack_LIFO.v:46$2_DATA' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
Latch inferred for signal `\Stack_LIFO.\next_dout' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$208
Latch inferred for signal `\Stack_LIFO.\stack[0]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$217
Latch inferred for signal `\Stack_LIFO.\stack[1]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$268
Latch inferred for signal `\Stack_LIFO.\stack[2]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$313
Latch inferred for signal `\Stack_LIFO.\stack[3]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$358
Latch inferred for signal `\Stack_LIFO.\stack[4]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$403
Latch inferred for signal `\Stack_LIFO.\stack[5]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$448
Latch inferred for signal `\Stack_LIFO.\stack[6]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$493
Latch inferred for signal `\Stack_LIFO.\stack[7]' from process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10': $auto$proc_dlatch.cc:427:proc_dlatch$538

yosys> proc_dff

4.2.9. Executing PROC_DFF pass (convert process syncs to FFs).
Creating register for signal `\Stack_LIFO.\dout' using process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:20$3'.
  created $dff cell `$procdff$583' with positive edge clock.
Creating register for signal `\Stack_LIFO.\index' using process `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:20$3'.
  created $dff cell `$procdff$584' with positive edge clock.

yosys> proc_memwr

4.2.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

4.2.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Found and cleaned up 4 empty switches in `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
Removing empty process `Stack_LIFO.$proc$inputs/Stack_LIFO.v:37$10'.
Found and cleaned up 1 empty switch in `\Stack_LIFO.$proc$inputs/Stack_LIFO.v:20$3'.
Removing empty process `Stack_LIFO.$proc$inputs/Stack_LIFO.v:20$3'.
Cleaned up 5 empty switches.

yosys> opt_expr -keepdc

4.2.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.
<suppressed ~190 debug messages>

yosys> flatten

4.3. Executing FLATTEN pass (flatten design).

yosys> opt_expr

4.4. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_clean

4.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 26 unused cells and 280 unused wires.
<suppressed ~27 debug messages>

yosys> check

4.6. Executing CHECK pass (checking for obvious problems).
Checking module Stack_LIFO...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

4.7. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.7.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge -nomux

4.7.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
<suppressed ~147 debug messages>
Removed a total of 49 cells.

yosys> opt_muxtree

4.7.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
    dead port 1/2 on $mux $procmux$44.
Removed 1 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

4.7.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
    New input vector for $reduce_or cell $reduce_or$inputs/Stack_LIFO.v:35$8: { $auto$rtlil.cc:2399:Not$586 \index [7:4] \index [2:0] }
    New ctrl vector for $pmux cell $procmux$26: { $procmux$33_CMP $procmux$32_CMP $procmux$31_CMP $procmux$30_CMP $procmux$29_CMP $procmux$28_CMP $procmux$27_CMP }
  Optimizing cells in module \Stack_LIFO.
Performed a total of 2 changes.

yosys> opt_merge

4.7.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.7.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.7.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 1 unused cells and 51 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

4.7.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

4.7.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.7.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

4.7.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
Performed a total of 0 changes.

yosys> opt_merge

4.7.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.7.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.7.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> opt_expr

4.7.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

4.7.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

4.8. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

4.8.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

4.8.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

4.8.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

4.8.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> fsm_opt

4.8.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

4.8.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

4.8.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

4.8.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt

4.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge -nomux

4.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~3 debug messages>

yosys> opt_reduce

4.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
Performed a total of 0 changes.

yosys> opt_merge

4.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff

4.9.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding SRST signal on $procdff$584 ($dff) from module Stack_LIFO (D = \next_index, Q = \index, rval = 8'00000000).
Adding EN signal on $auto$ff.cc:266:slice$587 ($sdff) from module Stack_LIFO (D = \next_index, Q = \index).
Adding SRST signal on $procdff$583 ($dff) from module Stack_LIFO (D = \next_dout, Q = \dout, rval = 8'00000000).

yosys> opt_clean

4.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 2 unused cells and 2 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

4.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.
<suppressed ~1 debug messages>

4.9.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.9.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

4.9.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
Performed a total of 0 changes.

yosys> opt_merge

4.9.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff

4.9.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.9.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> opt_expr

4.9.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

4.9.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce

4.10. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 3) from port B of cell Stack_LIFO.$procmux$31_CMP0 ($eq).
Removed top 1 bits (of 3) from port B of cell Stack_LIFO.$procmux$32_CMP0 ($eq).
Removed top 2 bits (of 3) from port B of cell Stack_LIFO.$procmux$33_CMP0 ($eq).
Removed top 1 bits (of 3) from port B of cell Stack_LIFO.$procmux$106_CMP0 ($eq).
Removed top 1 bits (of 3) from port B of cell Stack_LIFO.$procmux$107_CMP0 ($eq).
Removed top 2 bits (of 3) from port B of cell Stack_LIFO.$procmux$108_CMP0 ($eq).

yosys> peepopt

4.11. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

4.12. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> alumacc

4.13. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module Stack_LIFO:
  creating $macc model for $add$inputs/Stack_LIFO.v:42$19 ($add).
  creating $macc model for $sub$inputs/Stack_LIFO.v:46$22 ($sub).
  creating $alu model for $macc $sub$inputs/Stack_LIFO.v:46$22.
  creating $alu model for $macc $add$inputs/Stack_LIFO.v:42$19.
  creating $alu cell for $add$inputs/Stack_LIFO.v:42$19: $auto$alumacc.cc:485:replace_alu$592
  creating $alu cell for $sub$inputs/Stack_LIFO.v:46$22: $auto$alumacc.cc:485:replace_alu$595
  created 2 $alu and 0 $macc cells.

yosys> share

4.14. Executing SHARE pass (SAT-based resource sharing).

yosys> opt

4.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge -nomux

4.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

4.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
Performed a total of 0 changes.

yosys> opt_merge

4.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff

4.15.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> opt_expr

4.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

4.15.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

4.16. Executing MEMORY pass.

yosys> opt_mem

4.16.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

4.16.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

4.16.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

4.16.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

4.16.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

4.16.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> memory_share

4.16.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

4.16.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

4.16.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> memory_collect

4.16.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

4.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> synth -flatten -top Stack_LIFO -run fine:check

5. Executing SYNTH pass.

yosys> opt -fast -full

5.1. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.1.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.
<suppressed ~1 debug messages>

yosys> opt_merge

5.1.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff

5.1.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.1.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

5.1.5. Finished fast OPT passes.

yosys> memory_map

5.2. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

5.3. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.3.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge -nomux

5.3.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.3.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

5.3.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
Performed a total of 0 changes.

yosys> opt_merge

5.3.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_share

5.3.6. Executing OPT_SHARE pass.

yosys> opt_dff

5.3.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.3.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> opt_expr -full

5.3.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

5.3.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

5.4. Executing TECHMAP pass (map to technology primitives).

5.4.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.4.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using template $paramod$c3cd1564c35d873179656addd6052d7ea8b6d991\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$403a3c2fa431a154c52a6a5429d7a6260b5d144f\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $eq.
Using template $paramod$d7387fdb214042e5ef2d69a3f74948694b4bb65e\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dlatch.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $sdffe.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~452 debug messages>

yosys> opt -fast

5.5. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.5.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.
<suppressed ~125 debug messages>

yosys> opt_merge

5.5.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
<suppressed ~177 debug messages>
Removed a total of 59 cells.

yosys> opt_dff

5.5.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.5.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 11 unused cells and 207 unused wires.
<suppressed ~12 debug messages>

5.5.5. Finished fast OPT passes.

yosys> abc -fast

5.6. Executing ABC pass (technology mapping using ABC).

5.6.1. Extracting gate netlist of module `\Stack_LIFO' to `<abc-temp-dir>/input.blif'..
Extracted 288 gates and 370 wires to a netlist network with 82 inputs and 27 outputs.

5.6.1.1. Executing ABC.
Running ABC command: "<yosys-exe-dir>/yosys-abc" -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + dretime 
ABC: + map 
ABC: + write_blif <abc-temp-dir>/output.blif 

5.6.1.2. Re-integrating ABC results.
ABC RESULTS:             ORNOT cells:       10
ABC RESULTS:               NOR cells:        7
ABC RESULTS:               NOT cells:        4
ABC RESULTS:                OR cells:       89
ABC RESULTS:               AND cells:        5
ABC RESULTS:              NAND cells:        7
ABC RESULTS:            ANDNOT cells:       79
ABC RESULTS:               XOR cells:       12
ABC RESULTS:               MUX cells:       26
ABC RESULTS:        internal signals:      261
ABC RESULTS:           input signals:       82
ABC RESULTS:          output signals:       27
Removing temp directory.

yosys> opt -fast

5.7. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.7.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.
<suppressed ~16 debug messages>

yosys> opt_merge

5.7.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
<suppressed ~15 debug messages>
Removed a total of 5 cells.

yosys> opt_dff

5.7.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.7.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 1 unused cells and 236 unused wires.
<suppressed ~2 debug messages>

5.7.5. Finished fast OPT passes.

yosys> opt -purge

6. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

6.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge -nomux

6.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_muxtree

6.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

6.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
Performed a total of 0 changes.

yosys> opt_merge

6.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff

6.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

6.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> opt_expr

6.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

6.9. Finished OPT passes. (There is nothing left to do.)

yosys> extract_fa

7. Executing EXTRACT_FA pass (find and extract full/half adders).
Extracting full/half adders from Stack_LIFO:
  2-Input XOR/XNOR \index [2] $abc$1508$new_n119_:
    0110 -> $abc$1508$new_n173_
    AND with inverted A:
      0100 -> $abc$1508$new_n124_
      Created $fa cell $auto$extract_fa.cc:503:run$1748.
    AND without inversions:
      1000 -> $abc$1508$new_n120_
      Created $fa cell $auto$extract_fa.cc:503:run$1757.
  2-Input XOR/XNOR \index [0] \index [1]:
    1001 -> $abc$1508$new_n313_
    0110 -> $abc$1508$new_n314_
    AND with inverted A B Y:
      1110 -> $abc$1508$new_n171_
      Created $fa cell $auto$extract_fa.cc:503:run$1761.
    AND with inverted A B:
      0001 -> $abc$1508$new_n119_
      Created $fa cell $auto$extract_fa.cc:503:run$1775.
    AND with inverted A Y:
      1011 -> $abc$1508$new_n114_
      Created $fa cell $auto$extract_fa.cc:503:run$1785.
    AND with inverted B Y:
      1101 -> $abc$1508$new_n117_
      Created $fa cell $auto$extract_fa.cc:503:run$1795.
    AND with inverted Y:
      0111 -> $abc$1508$new_n175_
      Created $fa cell $auto$extract_fa.cc:503:run$1805.
    AND without inversions:
      1000 -> $abc$1508$new_n112_
      Created $fa cell $auto$extract_fa.cc:503:run$1813.
  2-Input XOR/XNOR \index [2] $abc$1508$new_n112_:
    0110 -> $abc$1508$new_n316_
    AND with inverted A:
      0100 -> $abc$1508$new_n134_
      Created $fa cell $auto$extract_fa.cc:503:run$1819.
    AND without inversions:
      1000 -> $abc$1508$new_n113_
      Created $fa cell $auto$extract_fa.cc:503:run$1828.
  2-Input XOR/XNOR \index [3] $abc$1508$new_n124_:
    0110 -> $abc$1508$new_n319_
  2-Input XOR/XNOR \index [3] $abc$1508$new_n113_:
    0110 -> $abc$1508$new_n320_
  2-Input XOR/XNOR \index [4] $abc$1508$new_n324_:
    0110 -> $abc$1508$new_n325_
    AND with inverted A:
      0100 -> $abc$1508$new_n330_
      Created $fa cell $auto$extract_fa.cc:503:run$1832.
  2-Input XOR/XNOR \index [4] $abc$1508$new_n327_:
    0110 -> $abc$1508$new_n328_
    AND without inversions:
      1000 -> $abc$1508$new_n332_
      Created $fa cell $auto$extract_fa.cc:503:run$1841.
  2-Input XOR/XNOR \index [5] $abc$1508$new_n330_:
    0110 -> $abc$1508$new_n331_
  2-Input XOR/XNOR \index [5] $abc$1508$new_n332_:
    0110 -> $abc$1508$new_n333_
  2-Input XOR/XNOR \index [6] $abc$1508$new_n338_:
    1001 -> $abc$1508$new_n339_
    AND with inverted A B:
      0001 -> $abc$1508$new_n344_
      Created $fa cell $auto$extract_fa.cc:503:run$1846.
  2-Input XOR/XNOR $abc$1508$new_n338_ $abc$1508$new_n335_:
    0110 -> $abc$1508$new_n339_
    AND with inverted A:
      0100 -> $abc$1508$new_n344_
      Created $fa cell $auto$extract_fa.cc:503:run$1857.
  2-Input XOR/XNOR \index [6] $abc$1508$new_n341_:
    1001 -> $abc$1508$new_n342_
    AND with inverted B:
      0010 -> $abc$1508$new_n346_
      Created $fa cell $auto$extract_fa.cc:503:run$1864.
  2-Input XOR/XNOR $abc$1508$new_n341_ $abc$1508$new_n335_:
    0110 -> $abc$1508$new_n342_
  2-Input XOR/XNOR \index [7] $abc$1508$new_n344_:
    0110 -> $abc$1508$new_n345_
  2-Input XOR/XNOR \index [7] $abc$1508$new_n346_:
    0110 -> $abc$1508$new_n347_

yosys> techmap -map /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_adders.v

8. Executing TECHMAP pass (map to technology primitives).

8.1. Executing Verilog-2005 frontend: /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_adders.v
Parsing Verilog input from `/third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_adders.v' to AST representation.
Generating RTLIL representation for module `\_tech_fa'.
Successfully finished Verilog frontend.

8.2. Continuing TECHMAP pass.
Using template $paramod$366b53aa83fc1f56a6a9bf0b408f4c58a4c2aa2e\_tech_fa for cells of type $fa.
No more expansions possible.
<suppressed ~35 debug messages>

yosys> techmap

9. Executing TECHMAP pass (map to technology primitives).

9.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

9.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -fast -purge

10. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

10.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge

10.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
<suppressed ~24 debug messages>
Removed a total of 8 cells.

yosys> opt_dff

10.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

10.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 29 unused cells and 135 unused wires.
<suppressed ~30 debug messages>

10.5. Finished fast OPT passes.

yosys> techmap -map /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v

11. Executing TECHMAP pass (map to technology primitives).

11.1. Executing Verilog-2005 frontend: /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v
Parsing Verilog input from `/third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v' to AST representation.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Successfully finished Verilog frontend.

11.2. Continuing TECHMAP pass.
Using template \$_DLATCH_N_ for cells of type $_DLATCH_N_.
No more expansions possible.
<suppressed ~76 debug messages>

yosys> techmap

12. Executing TECHMAP pass (map to technology primitives).

12.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

12.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -fast -purge

13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge

13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff

13.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

13.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..
Removed 0 unused cells and 216 unused wires.
<suppressed ~1 debug messages>

13.5. Finished fast OPT passes.

yosys> autoname

14. Executing AUTONAME pass.
Renamed 4116 objects in module Stack_LIFO (47 iterations).
<suppressed ~563 debug messages>

yosys> dfflibmap -liberty /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_dff_library.lib

15. Executing DFFLIBMAP pass (mapping DFF cells to sequential cells from liberty file).
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfxtp_1 (noninv, pins=3, area=20.02) is a direct match for cell type $_DFF_P_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
  cell sky130_fd_sc_hd__dfrtn_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_NN0_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfrtp_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_PN0_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfstp_2 (noninv, pins=4, area=26.28) is a direct match for cell type $_DFF_PN1_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
  cell sky130_fd_sc_hd__dfbbn_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_NNN_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfbbp_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_PNN_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  final dff cell mappings:
    unmapped dff cell: $_DFF_N_
    \sky130_fd_sc_hd__dfxtp_1 _DFF_P_ (.CLK( C), .D( D), .Q( Q));
    \sky130_fd_sc_hd__dfrtn_1 _DFF_NN0_ (.CLK_N( C), .D( D), .Q( Q), .RESET_B( R));
    unmapped dff cell: $_DFF_NN1_
    unmapped dff cell: $_DFF_NP0_
    unmapped dff cell: $_DFF_NP1_
    \sky130_fd_sc_hd__dfrtp_1 _DFF_PN0_ (.CLK( C), .D( D), .Q( Q), .RESET_B( R));
    \sky130_fd_sc_hd__dfstp_2 _DFF_PN1_ (.CLK( C), .D( D), .Q( Q), .SET_B( R));
    unmapped dff cell: $_DFF_PP0_
    unmapped dff cell: $_DFF_PP1_
    \sky130_fd_sc_hd__dfbbn_1 _DFFSR_NNN_ (.CLK_N( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    unmapped dff cell: $_DFFSR_NNP_
    unmapped dff cell: $_DFFSR_NPN_
    unmapped dff cell: $_DFFSR_NPP_
    \sky130_fd_sc_hd__dfbbp_1 _DFFSR_PNN_ (.CLK( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    unmapped dff cell: $_DFFSR_PNP_
    unmapped dff cell: $_DFFSR_PPN_
    unmapped dff cell: $_DFFSR_PPP_

yosys> dfflegalize -cell $_DFF_P_ 01 -cell $_DFF_NN0_ 01 -cell $_DFF_PN0_ 01 -cell $_DFF_PN1_ 01 -cell $_DFFSR_NNN_ 01 -cell $_DFFSR_PNN_ 01 t:$_DFF* t:$_SDFF*

15.1. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).
Mapping DFF cells in module `\Stack_LIFO':
  mapped 16 $_DFF_P_ cells to \sky130_fd_sc_hd__dfxtp_1 cells.

yosys> techmap

16. Executing TECHMAP pass (map to technology primitives).

16.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

16.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -purge

17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

yosys> opt_merge -nomux

17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_muxtree

17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Stack_LIFO..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Stack_LIFO.
Performed a total of 0 changes.

yosys> opt_merge

17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Stack_LIFO'.
Removed a total of 0 cells.

yosys> opt_dff

17.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Stack_LIFO..

yosys> opt_expr

17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Stack_LIFO.

17.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -liberty /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_dff_library.lib -D 10000 -constr /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_abc.constraints -liberty /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_logiclib_sky130hd.lib

18. Executing ABC pass (technology mapping using ABC).

18.1. Extracting gate netlist of module `\Stack_LIFO' to `<abc-temp-dir>/input.blif'..
Extracted 249 gates and 362 wires to a netlist network with 112 inputs and 43 outputs.

18.1.1. Executing ABC.
Running ABC command: "<yosys-exe-dir>/yosys-abc" -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_lib -w /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_dff_library.lib 
ABC: Parsing finished successfully.  Parsing time =     0.12 sec
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__buf_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__diode_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_8".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_0".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_8".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_8".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_bleeder_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_12" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_3" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_6" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__lpflow_inputisolatch_1".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrckapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probe_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probec_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_4".
ABC: Library "sky130_fd_sc_hd__ss_n40C_1v40" from "/nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_dff_library.lib" has 301 cells (88 skipped: 63 seq; 13 tri-state; 12 no func; 39 dont_use).  Time =     0.19 sec
ABC: Memory =   19.86 MB. Time =     0.19 sec
ABC: Warning: Detected 9 multi-output gates (for example, "sky130_fd_sc_hd__fa_1").
ABC: + read_lib -w /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_logiclib_sky130hd.lib 
ABC: Parsing finished successfully.  Parsing time =     0.12 sec
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__buf_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__diode_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_8".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_0".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_8".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_8".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_bleeder_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_12" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_3" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_6" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__lpflow_inputisolatch_1".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrckapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probe_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probec_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_4".
ABC: Library "sky130hd_merged" from "/nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_logiclib_sky130hd.lib" has 301 cells (88 skipped: 63 seq; 13 tri-state; 12 no func; 39 dont_use).  Time =     0.18 sec
ABC: Memory =   19.86 MB. Time =     0.18 sec
ABC: Warning: Detected 9 multi-output gates (for example, "sky130_fd_sc_hd__fa_1").
ABC: + read_constr -v /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_abc.constraints 
ABC: Setting driving cell to be "sky130_fd_sc_hd__buf_4".
ABC: + strash 
ABC: + &get -n 
ABC: + &fraig -x 
ABC: + &put 
ABC: + scorr 
ABC: Warning: The network is combinational (run "fraig" or "fraig_sweep").
ABC: + dc2 
ABC: + dretime 
ABC: + retime -o -D 10000 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf -D 10000 
ABC: + &put 
ABC: + buffer 
ABC: + upsize -D 10000 
ABC: Current delay (6574.41 ps) does not exceed the target delay (10000.00 ps). Upsizing is not performed.
ABC: + dnsize -D 10000 
ABC: + stime -p 
ABC: WireLoad = "none"  Gates =    162 ( 11.7 %)   Cap =  3.1 ff ( 13.0 %)   Area =     1028.49 ( 64.2 %)   Delay =  6021.68 ps  ( 11.7 %)               
ABC: Path  0 --      36 : 0    4 pi                        A =   0.00  Df =  66.9  -27.5 ps  S = 126.7 ps  Cin =  0.0 ff  Cout =   7.8 ff  Cmax =   0.0 ff  G =    0  
ABC: Path  1 --     231 : 2    1 sky130_fd_sc_hd__nor2b_1  A =   6.26  Df = 497.2  -30.0 ps  S = 264.8 ps  Cin =  1.7 ff  Cout =   1.9 ff  Cmax = 138.9 ff  G =  106  
ABC: Path  2 --     232 : 1    9 sky130_fd_sc_hd__clkbuf_1 A =   3.75  Df =1388.3 -452.5 ps  S = 902.6 ps  Cin =  1.8 ff  Cout =  19.5 ff  Cmax = 228.1 ff  G = 1045  
ABC: Path  3 --     233 : 4    8 sky130_fd_sc_hd__nor4_1   A =   6.26  Df =3992.8-1980.5 ps  S =3579.5 ps  Cin =  2.1 ff  Cout =  18.0 ff  Cmax =  54.9 ff  G =  809  
ABC: Path  4 --     246 : 4    1 sky130_fd_sc_hd__a211o_1  A =   8.76  Df =5660.5-2006.5 ps  S = 118.1 ps  Cin =  2.1 ff  Cout =   1.6 ff  Cmax = 368.5 ff  G =   72  
ABC: Path  5 --     247 : 3    1 sky130_fd_sc_hd__mux2_2   A =  11.26  Df =6021.7-1127.1 ps  S = 142.4 ps  Cin =  2.0 ff  Cout =   0.0 ff  Cmax = 546.3 ff  G =    0  
ABC: Start-point = pi35 (\next_index_$_MUX__Y_6_B_sky130_fd_sc_hd__ha_1_SUM_B_sky130_fd_sc_hd__ha_1_B_COUT).  End-point = po31 (\pop_$_MUX__S_Y [7]).
ABC: + write_blif <abc-temp-dir>/output.blif 

18.1.2. Re-integrating ABC results.
ABC RESULTS:   sky130_fd_sc_hd__xnor2_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__or2_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__xor2_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__and2_0 cells:       10
ABC RESULTS:   sky130_fd_sc_hd__and4_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nand2b_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nor3_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__mux2i_1 cells:        4
ABC RESULTS:   sky130_fd_sc_hd__a21oi_1 cells:       11
ABC RESULTS:   sky130_fd_sc_hd__and2_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nor3b_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__inv_1 cells:        5
ABC RESULTS:   sky130_fd_sc_hd__nor4_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nor2b_1 cells:        4
ABC RESULTS:   sky130_fd_sc_hd__buf_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__clkbuf_1 cells:       11
ABC RESULTS:   sky130_fd_sc_hd__a221o_1 cells:        8
ABC RESULTS:   sky130_fd_sc_hd__nand3b_1 cells:       17
ABC RESULTS:   sky130_fd_sc_hd__nand4_1 cells:        8
ABC RESULTS:   sky130_fd_sc_hd__a211o_1 cells:        8
ABC RESULTS:   sky130_fd_sc_hd__mux2_2 cells:        9
ABC RESULTS:   sky130_fd_sc_hd__o211ai_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nor2_1 cells:        8
ABC RESULTS:   sky130_fd_sc_hd__nand3_1 cells:       19
ABC RESULTS:   sky130_fd_sc_hd__nand2_1 cells:        4
ABC RESULTS:   sky130_fd_sc_hd__and3_1 cells:       11
ABC RESULTS:   sky130_fd_sc_hd__o21ai_0 cells:        9
ABC RESULTS:        internal signals:      207
ABC RESULTS:           input signals:      112
ABC RESULTS:          output signals:       43
Removing temp directory.

yosys> clean -purge
Removed 0 unused cells and 354 unused wires.

yosys> setundef -zero

19. Executing SETUNDEF pass (replace undef values with defined constants).

yosys> splitnets

20. Executing SPLITNETS pass (splitting up multi-bit signals).

yosys> clean -purge

yosys> hilomap -singleton -locell sky130_fd_sc_hd__conb_1 LO -hicell sky130_fd_sc_hd__conb_1 HI

21. Executing HILOMAP pass (mapping to constant drivers).

yosys> insbuf -buf sky130_fd_sc_hd__buf_4 A X

22. Executing INSBUF pass (insert buffer cells for connected wires).

yosys> clean -purge

yosys> echo off
echo off
{
   "creator": "Yosys 0.30+48 (git sha1 14d50a176, clang 10.0.0-4ubuntu1 -fPIC -Os)",
   "invocation": "stat -json -top Stack_LIFO -liberty /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_dff_library.lib -liberty /nfs/sc_compute/fb16df2aaa68424d8b48f2adef893dff/Stack_LIFO/job0/syn/0/inputs/sc_logiclib_sky130hd.lib ",
   "modules": {
      "\\Stack_LIFO": {
         "num_wires":         276,
         "num_wire_bits":     290,
         "num_pub_wires":     141,
         "num_pub_wire_bits": 155,
         "num_memories":      0,
         "num_memory_bits":   0,
         "num_processes":     0,
         "num_cells":         264,
         "area":              2604.998400,
         "num_cells_by_type": {
            "sky130_fd_sc_hd__a211o_1": 8,
            "sky130_fd_sc_hd__a21oi_1": 11,
            "sky130_fd_sc_hd__a221o_1": 8,
            "sky130_fd_sc_hd__and2_0": 10,
            "sky130_fd_sc_hd__and2_1": 1,
            "sky130_fd_sc_hd__and3_1": 11,
            "sky130_fd_sc_hd__and4_1": 1,
            "sky130_fd_sc_hd__buf_1": 3,
            "sky130_fd_sc_hd__clkbuf_1": 11,
            "sky130_fd_sc_hd__dfxtp_1": 16,
            "sky130_fd_sc_hd__dlxtn_1": 72,
            "sky130_fd_sc_hd__ha_1": 14,
            "sky130_fd_sc_hd__inv_1": 5,
            "sky130_fd_sc_hd__mux2_2": 9,
            "sky130_fd_sc_hd__mux2i_1": 4,
            "sky130_fd_sc_hd__nand2_1": 4,
            "sky130_fd_sc_hd__nand2b_1": 1,
            "sky130_fd_sc_hd__nand3_1": 19,
            "sky130_fd_sc_hd__nand3b_1": 17,
            "sky130_fd_sc_hd__nand4_1": 8,
            "sky130_fd_sc_hd__nor2_1": 8,
            "sky130_fd_sc_hd__nor2b_1": 4,
            "sky130_fd_sc_hd__nor3_1": 2,
            "sky130_fd_sc_hd__nor3b_1": 3,
            "sky130_fd_sc_hd__nor4_1": 1,
            "sky130_fd_sc_hd__o211ai_1": 1,
            "sky130_fd_sc_hd__o21ai_0": 9,
            "sky130_fd_sc_hd__or2_1": 1,
            "sky130_fd_sc_hd__xnor2_1": 1,
            "sky130_fd_sc_hd__xor2_1": 1
         }
      }
   },
      "design": {
         "num_wires":         276,
         "num_wire_bits":     290,
         "num_pub_wires":     141,
         "num_pub_wire_bits": 155,
         "num_memories":      0,
         "num_memory_bits":   0,
         "num_processes":     0,
         "num_cells":         264,
         "area":              2604.998400,
         "num_cells_by_type": {
            "sky130_fd_sc_hd__a211o_1": 8,
            "sky130_fd_sc_hd__a21oi_1": 11,
            "sky130_fd_sc_hd__a221o_1": 8,
            "sky130_fd_sc_hd__and2_0": 10,
            "sky130_fd_sc_hd__and2_1": 1,
            "sky130_fd_sc_hd__and3_1": 11,
            "sky130_fd_sc_hd__and4_1": 1,
            "sky130_fd_sc_hd__buf_1": 3,
            "sky130_fd_sc_hd__clkbuf_1": 11,
            "sky130_fd_sc_hd__dfxtp_1": 16,
            "sky130_fd_sc_hd__dlxtn_1": 72,
            "sky130_fd_sc_hd__ha_1": 14,
            "sky130_fd_sc_hd__inv_1": 5,
            "sky130_fd_sc_hd__mux2_2": 9,
            "sky130_fd_sc_hd__mux2i_1": 4,
            "sky130_fd_sc_hd__nand2_1": 4,
            "sky130_fd_sc_hd__nand2b_1": 1,
            "sky130_fd_sc_hd__nand3_1": 19,
            "sky130_fd_sc_hd__nand3b_1": 17,
            "sky130_fd_sc_hd__nand4_1": 8,
            "sky130_fd_sc_hd__nor2_1": 8,
            "sky130_fd_sc_hd__nor2b_1": 4,
            "sky130_fd_sc_hd__nor3_1": 2,
            "sky130_fd_sc_hd__nor3b_1": 3,
            "sky130_fd_sc_hd__nor4_1": 1,
            "sky130_fd_sc_hd__o211ai_1": 1,
            "sky130_fd_sc_hd__o21ai_0": 9,
            "sky130_fd_sc_hd__or2_1": 1,
            "sky130_fd_sc_hd__xnor2_1": 1,
            "sky130_fd_sc_hd__xor2_1": 1
         }
      }
}

echo on

yosys> write_verilog -noattr -noexpr -nohex -nodec outputs/Stack_LIFO.vg

23. Executing Verilog backend.

yosys> clean_zerowidth
Dumping module `\Stack_LIFO'.

Warnings: 27 unique messages, 235 total
End of script. Logfile hash: 96c2d36059, CPU: user 1.20s system 0.04s, MEM: 121.31 MB peak
Yosys 0.30+48 (git sha1 14d50a176, clang 10.0.0-4ubuntu1 -fPIC -Os)
Time spent: 34% 2x abc (0 sec), 19% 1x stat (0 sec), ...
