
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.30+48 (git sha1 14d50a176, clang 10.0.0-4ubuntu1 -fPIC -Os)

echo on

yosys> read_verilog -sv inputs/Register_File.v

1. Executing Verilog-2005 frontend: inputs/Register_File.v
Parsing SystemVerilog input from `inputs/Register_File.v' to AST representation.
Warning: Yosys has only limited support for tri-state logic at the moment. (inputs/Register_File.v:40)
Warning: Yosys has only limited support for tri-state logic at the moment. (inputs/Register_File.v:45)
Generating RTLIL representation for module `\Register_File'.
Successfully finished Verilog frontend.

yosys> chparam -list
Register_File:

yosys> read_liberty -lib /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_logiclib_sky130hd.lib

2. Executing Liberty frontend: /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_logiclib_sky130hd.lib
Imported 428 cell types from liberty file.

yosys> hierarchy -top Register_File

3. Executing HIERARCHY pass (managing design hierarchy).

3.1. Analyzing design hierarchy..
Top module:  \Register_File

3.2. Analyzing design hierarchy..
Top module:  \Register_File
Removed 0 unused modules.

yosys> synth -flatten -top Register_File -run begin:fine

4. Executing SYNTH pass.

yosys> hierarchy -check -top Register_File

4.1. Executing HIERARCHY pass (managing design hierarchy).

4.1.1. Analyzing design hierarchy..
Top module:  \Register_File

4.1.2. Analyzing design hierarchy..
Top module:  \Register_File
Removed 0 unused modules.

yosys> proc

4.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

4.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

4.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Marked 3 switch rules as full_case in process $proc$inputs/Register_File.v:30$35 in module Register_File.
Removed a total of 0 dead cases.

yosys> proc_prune

4.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 2 redundant assignments.
Promoted 36 assignments to connections.

yosys> proc_init

4.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

4.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

4.2.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.
<suppressed ~3 debug messages>

yosys> proc_mux

4.2.7. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `\Register_File.$proc$inputs/Register_File.v:0$81'.
Creating decoders for process `\Register_File.$proc$inputs/Register_File.v:30$35'.
     1/5: $0\read_data_2[31:0]
     2/5: $0\read_data_1[31:0]
     3/5: $1$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$44
     4/5: $1$memwr$\Registers$inputs/Register_File.v:34$34_DATA[31:0]$43
     5/5: $1$memwr$\Registers$inputs/Register_File.v:34$34_ADDR[4:0]$42

yosys> proc_dlatch

4.2.8. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `\Register_File.\i' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$2_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$3_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$4_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$5_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$6_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$7_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$8_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$9_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$10_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$11_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$12_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$13_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$14_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$15_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$16_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$17_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$18_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$19_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$20_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$21_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$22_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$23_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$24_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$25_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$26_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$27_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$28_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$29_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$30_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$31_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$32_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.
No latch inferred for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:26$33_EN' from process `\Register_File.$proc$inputs/Register_File.v:0$81'.

yosys> proc_dff

4.2.9. Executing PROC_DFF pass (convert process syncs to FFs).
Creating register for signal `\Register_File.\read_data_1' using process `\Register_File.$proc$inputs/Register_File.v:30$35'.
  created $dff cell `$procdff$129' with positive edge clock.
Creating register for signal `\Register_File.\read_data_2' using process `\Register_File.$proc$inputs/Register_File.v:30$35'.
  created $dff cell `$procdff$130' with positive edge clock.
Creating register for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:34$34_ADDR' using process `\Register_File.$proc$inputs/Register_File.v:30$35'.
  created $dff cell `$procdff$131' with positive edge clock.
Creating register for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:34$34_DATA' using process `\Register_File.$proc$inputs/Register_File.v:30$35'.
  created $dff cell `$procdff$132' with positive edge clock.
Creating register for signal `\Register_File.$memwr$\Registers$inputs/Register_File.v:34$34_EN' using process `\Register_File.$proc$inputs/Register_File.v:30$35'.
  created $dff cell `$procdff$133' with positive edge clock.

yosys> proc_memwr

4.2.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

4.2.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Removing empty process `Register_File.$proc$inputs/Register_File.v:0$81'.
Found and cleaned up 3 empty switches in `\Register_File.$proc$inputs/Register_File.v:30$35'.
Removing empty process `Register_File.$proc$inputs/Register_File.v:30$35'.
Cleaned up 3 empty switches.

yosys> opt_expr -keepdc

4.2.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.
<suppressed ~4 debug messages>

yosys> flatten

4.3. Executing FLATTEN pass (flatten design).

yosys> opt_expr

4.4. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_clean

4.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..
Removed 3 unused cells and 84 unused wires.
<suppressed ~4 debug messages>

yosys> check

4.6. Executing CHECK pass (checking for obvious problems).
Checking module Register_File...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

4.7. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.7.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge -nomux

4.7.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.7.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

4.7.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
    Consolidated identical input bits for $mux cell $procmux$121:
      Old ports: A=0, B=32'11111111111111111111111111111111, Y=$0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38
      New ports: A=1'0, B=1'1, Y=$0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0]
      New connections: $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [31:1] = { $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] $0$memwr$\Registers$inputs/Register_File.v:34$34_EN[31:0]$38 [0] }
  Optimizing cells in module \Register_File.
Performed a total of 1 changes.

yosys> opt_merge

4.7.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.7.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.7.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> opt_expr

4.7.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

4.7.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.7.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

4.7.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

4.7.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.7.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.7.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> opt_expr

4.7.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

4.7.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

4.8. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

4.8.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

4.8.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

4.8.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

4.8.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> fsm_opt

4.8.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

4.8.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

4.8.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

4.8.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt

4.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge -nomux

4.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

4.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

4.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

4.9.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> opt_expr

4.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

4.9.9. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce

4.10. Executing WREDUCE pass (reducing word size of cells).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$49 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$50 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$51 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$52 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$53 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$54 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$55 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$56 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$57 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$58 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$59 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$60 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$61 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$62 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$63 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$64 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$65 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$66 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$67 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$68 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$69 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$70 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$71 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$72 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$73 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$74 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$75 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$76 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$77 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$78 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$79 (Registers).
Removed top 27 address bits (of 32) from memory init port Register_File.$meminit$\Registers$inputs/Register_File.v:26$80 (Registers).

yosys> peepopt

4.11. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

4.12. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> alumacc

4.13. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module Register_File:
  created 0 $alu and 0 $macc cells.

yosys> share

4.14. Executing SHARE pass (SAT-based resource sharing).
Found 2 cells in module Register_File that may be considered for resource sharing.
  Analyzing resource sharing options for $memrd$\Registers$inputs/Register_File.v:43$48 ($memrd):
    Found 1 activation_patterns using ctrl signal \read_enable_2.
    Found 1 candidates: $memrd$\Registers$inputs/Register_File.v:38$46
    Analyzing resource sharing with $memrd$\Registers$inputs/Register_File.v:38$46 ($memrd):
      Found 1 activation_patterns using ctrl signal \read_enable_1.
      Activation pattern for cell $memrd$\Registers$inputs/Register_File.v:43$48: \read_enable_2 = 1'1
      Activation pattern for cell $memrd$\Registers$inputs/Register_File.v:38$46: \read_enable_1 = 1'1
      Size of SAT problem: 0 cells, 9 variables, 19 clauses
      According to the SAT solver this pair of cells can not be shared.
      Model from SAT solver: { \read_enable_2 \read_enable_1 } = 2'11
  Analyzing resource sharing options for $memrd$\Registers$inputs/Register_File.v:38$46 ($memrd):
    Found 1 activation_patterns using ctrl signal \read_enable_1.
    No candidates found.

yosys> opt

4.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge -nomux

4.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~5 debug messages>

yosys> opt_reduce

4.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

4.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

4.15.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> opt_expr

4.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

4.15.9. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

4.16. Executing MEMORY pass.

yosys> opt_mem

4.16.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

4.16.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

4.16.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).
  Analyzing Register_File.Registers write port 0.

yosys> memory_bmux2rom

4.16.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

4.16.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).
Checking read port `\Registers'[0] in module `\Register_File': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port `\Registers'[1] in module `\Register_File': FF found, but with a mux select that doesn't seem to correspond to transparency logic.
Checking read port address `\Registers'[0] in module `\Register_File': no address FF found.
Checking read port address `\Registers'[1] in module `\Register_File': no address FF found.

yosys> opt_clean

4.16.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> memory_share

4.16.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).
Consolidating read ports of memory Register_File.Registers by address:

yosys> opt_mem_widen

4.16.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

4.16.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> memory_collect

4.16.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

4.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> synth -flatten -top Register_File -run fine:check

5. Executing SYNTH pass.

yosys> opt -fast -full

5.1. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.1.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.
<suppressed ~5 debug messages>

yosys> opt_merge

5.1.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

5.1.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.1.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

5.1.5. Finished fast OPT passes.

yosys> memory_map

5.2. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).
Mapping memory \Registers in module \Register_File:
  created 32 $dff cells and 0 static cells of width 32.
  read interface: 0 $dff and 62 $mux cells.
  write interface: 32 write mux blocks.

yosys> opt -full

5.3. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

5.3.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.
<suppressed ~10 debug messages>

yosys> opt_merge -nomux

5.3.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.3.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~34 debug messages>

yosys> opt_reduce -full

5.3.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

5.3.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_share

5.3.6. Executing OPT_SHARE pass.

yosys> opt_dff

5.3.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.3.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..
Removed 0 unused cells and 101 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr -full

5.3.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

5.3.10. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.3.11. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~34 debug messages>

yosys> opt_reduce -full

5.3.12. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

5.3.13. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_share

5.3.14. Executing OPT_SHARE pass.

yosys> opt_dff

5.3.15. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $memory\Registers[9]$157 ($dff) from module Register_File (D = \write_data, Q = \Registers[9]).
Adding EN signal on $memory\Registers[8]$155 ($dff) from module Register_File (D = \write_data, Q = \Registers[8]).
Adding EN signal on $memory\Registers[7]$153 ($dff) from module Register_File (D = \write_data, Q = \Registers[7]).
Adding EN signal on $memory\Registers[6]$151 ($dff) from module Register_File (D = \write_data, Q = \Registers[6]).
Adding EN signal on $memory\Registers[5]$149 ($dff) from module Register_File (D = \write_data, Q = \Registers[5]).
Adding EN signal on $memory\Registers[4]$147 ($dff) from module Register_File (D = \write_data, Q = \Registers[4]).
Adding EN signal on $memory\Registers[3]$145 ($dff) from module Register_File (D = \write_data, Q = \Registers[3]).
Adding EN signal on $memory\Registers[31]$201 ($dff) from module Register_File (D = \write_data, Q = \Registers[31]).
Adding EN signal on $memory\Registers[30]$199 ($dff) from module Register_File (D = \write_data, Q = \Registers[30]).
Adding EN signal on $memory\Registers[2]$143 ($dff) from module Register_File (D = \write_data, Q = \Registers[2]).
Adding EN signal on $memory\Registers[29]$197 ($dff) from module Register_File (D = \write_data, Q = \Registers[29]).
Adding EN signal on $memory\Registers[28]$195 ($dff) from module Register_File (D = \write_data, Q = \Registers[28]).
Adding EN signal on $memory\Registers[27]$193 ($dff) from module Register_File (D = \write_data, Q = \Registers[27]).
Adding EN signal on $memory\Registers[26]$191 ($dff) from module Register_File (D = \write_data, Q = \Registers[26]).
Adding EN signal on $memory\Registers[25]$189 ($dff) from module Register_File (D = \write_data, Q = \Registers[25]).
Adding EN signal on $memory\Registers[24]$187 ($dff) from module Register_File (D = \write_data, Q = \Registers[24]).
Adding EN signal on $memory\Registers[23]$185 ($dff) from module Register_File (D = \write_data, Q = \Registers[23]).
Adding EN signal on $memory\Registers[22]$183 ($dff) from module Register_File (D = \write_data, Q = \Registers[22]).
Adding EN signal on $memory\Registers[21]$181 ($dff) from module Register_File (D = \write_data, Q = \Registers[21]).
Adding EN signal on $memory\Registers[20]$179 ($dff) from module Register_File (D = \write_data, Q = \Registers[20]).
Adding EN signal on $memory\Registers[1]$141 ($dff) from module Register_File (D = \write_data, Q = \Registers[1]).
Adding EN signal on $memory\Registers[19]$177 ($dff) from module Register_File (D = \write_data, Q = \Registers[19]).
Adding EN signal on $memory\Registers[18]$175 ($dff) from module Register_File (D = \write_data, Q = \Registers[18]).
Adding EN signal on $memory\Registers[17]$173 ($dff) from module Register_File (D = \write_data, Q = \Registers[17]).
Adding EN signal on $memory\Registers[16]$171 ($dff) from module Register_File (D = \write_data, Q = \Registers[16]).
Adding EN signal on $memory\Registers[15]$169 ($dff) from module Register_File (D = \write_data, Q = \Registers[15]).
Adding EN signal on $memory\Registers[14]$167 ($dff) from module Register_File (D = \write_data, Q = \Registers[14]).
Adding EN signal on $memory\Registers[13]$165 ($dff) from module Register_File (D = \write_data, Q = \Registers[13]).
Adding EN signal on $memory\Registers[12]$163 ($dff) from module Register_File (D = \write_data, Q = \Registers[12]).
Adding EN signal on $memory\Registers[11]$161 ($dff) from module Register_File (D = \write_data, Q = \Registers[11]).
Adding EN signal on $memory\Registers[10]$159 ($dff) from module Register_File (D = \write_data, Q = \Registers[10]).
Adding EN signal on $memory\Registers[0]$139 ($dff) from module Register_File (D = \write_data, Q = \Registers[0]).

yosys> opt_clean

5.3.16. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..
Removed 32 unused cells and 32 unused wires.
<suppressed ~33 debug messages>

yosys> opt_expr -full

5.3.17. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

5.3.18. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.3.19. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce -full

5.3.20. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

5.3.21. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_share

5.3.22. Executing OPT_SHARE pass.

yosys> opt_dff

5.3.23. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.3.24. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> opt_expr -full

5.3.25. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

5.3.26. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

5.4. Executing TECHMAP pass (map to technology primitives).

5.4.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.4.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $logic_and.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
No more expansions possible.
<suppressed ~256 debug messages>

yosys> opt -fast

5.5. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.5.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge

5.5.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

5.5.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.5.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

5.5.5. Finished fast OPT passes.

yosys> abc -fast

5.6. Executing ABC pass (technology mapping using ABC).

5.6.1. Extracting gate netlist of module `\Register_File' to `<abc-temp-dir>/input.blif'..
Extracted 2074 gates and 3114 wires to a netlist network with 1040 inputs and 96 outputs.

5.6.1.1. Executing ABC.
Running ABC command: "<yosys-exe-dir>/yosys-abc" -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + dretime 
ABC: + map 
ABC: + write_blif <abc-temp-dir>/output.blif 

5.6.1.2. Re-integrating ABC results.
ABC RESULTS:               MUX cells:     1984
ABC RESULTS:               NOR cells:        2
ABC RESULTS:               AND cells:        1
ABC RESULTS:               NOT cells:        9
ABC RESULTS:             ORNOT cells:        4
ABC RESULTS:              NAND cells:        2
ABC RESULTS:                OR cells:       42
ABC RESULTS:            ANDNOT cells:       33
ABC RESULTS:        internal signals:     1978
ABC RESULTS:           input signals:     1040
ABC RESULTS:          output signals:       96
Removing temp directory.

yosys> opt -fast

5.7. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.7.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.
<suppressed ~960 debug messages>

yosys> opt_merge

5.7.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

5.7.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.7.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..
Removed 8 unused cells and 1261 unused wires.
<suppressed ~9 debug messages>

5.7.5. Finished fast OPT passes.

yosys> opt -purge

6. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

6.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge -nomux

6.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_muxtree

6.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

6.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

6.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

6.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

6.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

6.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

6.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

6.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

6.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

6.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

6.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

6.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> opt_expr

6.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

6.16. Finished OPT passes. (There is nothing left to do.)

yosys> extract_fa

7. Executing EXTRACT_FA pass (find and extract full/half adders).
Extracting full/half adders from Register_File:

yosys> techmap -map /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_adders.v

8. Executing TECHMAP pass (map to technology primitives).

8.1. Executing Verilog-2005 frontend: /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_adders.v
Parsing Verilog input from `/third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_adders.v' to AST representation.
Generating RTLIL representation for module `\_tech_fa'.
Successfully finished Verilog frontend.

8.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~3 debug messages>

yosys> techmap

9. Executing TECHMAP pass (map to technology primitives).

9.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

9.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -fast -purge

10. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

10.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge

10.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

10.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

10.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

10.5. Finished fast OPT passes.

yosys> techmap -map /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v

11. Executing TECHMAP pass (map to technology primitives).

11.1. Executing Verilog-2005 frontend: /third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v
Parsing Verilog input from `/third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v' to AST representation.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Successfully finished Verilog frontend.

11.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> techmap

12. Executing TECHMAP pass (map to technology primitives).

12.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

12.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -fast -purge

13. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

13.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge

13.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

13.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

13.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

13.5. Finished fast OPT passes.

yosys> autoname

14. Executing AUTONAME pass.
Renamed 54671 objects in module Register_File (29 iterations).
<suppressed ~5164 debug messages>

yosys> dfflibmap -liberty /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_dff_library.lib

15. Executing DFFLIBMAP pass (mapping DFF cells to sequential cells from liberty file).
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfxtp_1 (noninv, pins=3, area=20.02) is a direct match for cell type $_DFF_P_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
  cell sky130_fd_sc_hd__dfrtn_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_NN0_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfrtp_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_PN0_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfstp_2 (noninv, pins=4, area=26.28) is a direct match for cell type $_DFF_PN1_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
  cell sky130_fd_sc_hd__dfbbn_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_NNN_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfbbp_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_PNN_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  final dff cell mappings:
    unmapped dff cell: $_DFF_N_
    \sky130_fd_sc_hd__dfxtp_1 _DFF_P_ (.CLK( C), .D( D), .Q( Q));
    \sky130_fd_sc_hd__dfrtn_1 _DFF_NN0_ (.CLK_N( C), .D( D), .Q( Q), .RESET_B( R));
    unmapped dff cell: $_DFF_NN1_
    unmapped dff cell: $_DFF_NP0_
    unmapped dff cell: $_DFF_NP1_
    \sky130_fd_sc_hd__dfrtp_1 _DFF_PN0_ (.CLK( C), .D( D), .Q( Q), .RESET_B( R));
    \sky130_fd_sc_hd__dfstp_2 _DFF_PN1_ (.CLK( C), .D( D), .Q( Q), .SET_B( R));
    unmapped dff cell: $_DFF_PP0_
    unmapped dff cell: $_DFF_PP1_
    \sky130_fd_sc_hd__dfbbn_1 _DFFSR_NNN_ (.CLK_N( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    unmapped dff cell: $_DFFSR_NNP_
    unmapped dff cell: $_DFFSR_NPN_
    unmapped dff cell: $_DFFSR_NPP_
    \sky130_fd_sc_hd__dfbbp_1 _DFFSR_PNN_ (.CLK( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    unmapped dff cell: $_DFFSR_PNP_
    unmapped dff cell: $_DFFSR_PPN_
    unmapped dff cell: $_DFFSR_PPP_

yosys> dfflegalize -cell $_DFF_P_ 01 -cell $_DFF_NN0_ 01 -cell $_DFF_PN0_ 01 -cell $_DFF_PN1_ 01 -cell $_DFFSR_NNN_ 01 -cell $_DFFSR_PNN_ 01 t:$_DFF* t:$_SDFF*

15.1. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).
Mapping DFF cells in module `\Register_File':
  mapped 1088 $_DFF_P_ cells to \sky130_fd_sc_hd__dfxtp_1 cells.

yosys> techmap

16. Executing TECHMAP pass (map to technology primitives).

16.1. Executing Verilog-2005 frontend: /sc_tools/bin/../share/yosys/techmap.v
Parsing Verilog input from `/sc_tools/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

16.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -purge

17. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

17.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

yosys> opt_merge -nomux

17.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_muxtree

17.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Register_File..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

17.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Register_File.
Performed a total of 0 changes.

yosys> opt_merge

17.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Register_File'.
Removed a total of 0 cells.

yosys> opt_dff

17.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

17.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Register_File..

yosys> opt_expr

17.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module Register_File.

17.9. Finished OPT passes. (There is nothing left to do.)

yosys> abc -liberty /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_dff_library.lib -D 10000 -constr /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_abc.constraints -liberty /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_logiclib_sky130hd.lib

18. Executing ABC pass (technology mapping using ABC).

18.1. Extracting gate netlist of module `\Register_File' to `<abc-temp-dir>/input.blif'..
Extracted 3093 gates and 4165 wires to a netlist network with 1072 inputs and 1088 outputs.

18.1.1. Executing ABC.
Running ABC command: "<yosys-exe-dir>/yosys-abc" -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_lib -w /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_dff_library.lib 
ABC: Parsing finished successfully.  Parsing time =     0.12 sec
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__buf_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__diode_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_8".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_0".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_8".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_8".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_bleeder_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_12" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_3" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_6" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__lpflow_inputisolatch_1".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrckapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probe_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probec_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_4".
ABC: Library "sky130_fd_sc_hd__ss_n40C_1v40" from "/nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_dff_library.lib" has 301 cells (88 skipped: 63 seq; 13 tri-state; 12 no func; 39 dont_use).  Time =     0.18 sec
ABC: Memory =   19.86 MB. Time =     0.18 sec
ABC: Warning: Detected 9 multi-output gates (for example, "sky130_fd_sc_hd__fa_1").
ABC: + read_lib -w /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_logiclib_sky130hd.lib 
ABC: Parsing finished successfully.  Parsing time =     0.12 sec
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__buf_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__diode_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_8".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_0".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_8".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_8".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_bleeder_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_12" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_3" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_6" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__lpflow_inputisolatch_1".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrckapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probe_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probec_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_4".
ABC: Library "sky130hd_merged" from "/nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_logiclib_sky130hd.lib" has 301 cells (88 skipped: 63 seq; 13 tri-state; 12 no func; 39 dont_use).  Time =     0.18 sec
ABC: Memory =   19.86 MB. Time =     0.18 sec
ABC: Warning: Detected 9 multi-output gates (for example, "sky130_fd_sc_hd__fa_1").
ABC: + read_constr -v /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_abc.constraints 
ABC: Setting driving cell to be "sky130_fd_sc_hd__buf_4".
ABC: + strash 
ABC: + &get -n 
ABC: + &fraig -x 
ABC: + &put 
ABC: + scorr 
ABC: Warning: The network is combinational (run "fraig" or "fraig_sweep").
ABC: + dc2 
ABC: + dretime 
ABC: + retime -o -D 10000 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf -D 10000 
ABC: + &put 
ABC: + buffer 
ABC: + upsize -D 10000 
ABC: Current delay (8044.05 ps) does not exceed the target delay (10000.00 ps). Upsizing is not performed.
ABC: + dnsize -D 10000 
ABC: + stime -p 
ABC: WireLoad = "none"  Gates =   2119 ( 17.7 %)   Cap =  5.0 ff ( 16.2 %)   Area =    28008.11 ( 51.7 %)   Delay =  8927.83 ps  (  9.1 %)               
ABC: Path  0 --    1058 : 0    1 pi                        A =   0.00  Df =  17.8   -5.9 ps  S =  66.4 ps  Cin =  0.0 ff  Cout =   1.9 ff  Cmax =   0.0 ff  G =    0  
ABC: Path  1 --    3428 : 1    4 sky130_fd_sc_hd__clkbuf_1 A =   3.75  Df = 430.6  -87.8 ps  S = 381.8 ps  Cin =  1.8 ff  Cout =   7.5 ff  Cmax = 228.1 ff  G =  400  
ABC: Path  2 --    3440 : 1   10 sky130_fd_sc_hd__clkbuf_1 A =   3.75  Df =2346.4-1320.9 ps  S =2144.1 ps  Cin =  1.8 ff  Cout =  48.0 ff  Cmax = 228.1 ff  G = 2547  
ABC: Path  3 --    3441 : 1   10 sky130_fd_sc_hd__clkbuf_1 A =   3.75  Df =4588.7-2702.4 ps  S =1675.4 ps  Cin =  1.8 ff  Cout =  37.1 ff  Cmax = 228.1 ff  G = 1977  
ABC: Path  4 --    3588 : 1   10 sky130_fd_sc_hd__clkbuf_1 A =   3.75  Df =6408.0-3782.2 ps  S =1330.4 ps  Cin =  1.8 ff  Cout =  29.2 ff  Cmax = 228.1 ff  G = 1591  
ABC: Path  5 --    3589 : 6    1 sky130_fd_sc_hd__mux4_2   A =  22.52  Df =7871.9-3462.5 ps  S = 256.8 ps  Cin =  2.3 ff  Cout =   1.6 ff  Cmax = 540.9 ff  G =   66  
ABC: Path  6 --    3592 : 6    1 sky130_fd_sc_hd__mux4_2   A =  22.52  Df =8552.3-1592.6 ps  S = 258.8 ps  Cin =  2.3 ff  Cout =   1.8 ff  Cmax = 540.9 ff  G =   73  
ABC: Path  7 --    3599 : 3    1 sky130_fd_sc_hd__mux2_2   A =  11.26  Df =8927.8 -682.3 ps  S = 142.4 ps  Cin =  2.0 ff  Cout =   0.0 ff  Cmax = 546.3 ff  G =    0  
ABC: Start-point = pi1057 (\read_index_1 [0]).  End-point = po1034 (\read_data_1_$_DFF_P__Q_D [13]).
ABC: + write_blif <abc-temp-dir>/output.blif 

18.1.2. Re-integrating ABC results.
ABC RESULTS:   sky130_fd_sc_hd__nor3_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__or3_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nand3_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nand2b_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__and3b_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__and2_0 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nand3b_1 cells:        5
ABC RESULTS:   sky130_fd_sc_hd__nand4bb_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__nand4b_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__nand4_1 cells:        8
ABC RESULTS:   sky130_fd_sc_hd__nor3b_1 cells:        5
ABC RESULTS:   sky130_fd_sc_hd__nor2_1 cells:       11
ABC RESULTS:   sky130_fd_sc_hd__nand2_1 cells:        6
ABC RESULTS:   sky130_fd_sc_hd__buf_1 cells:       49
ABC RESULTS:   sky130_fd_sc_hd__clkbuf_1 cells:      326
ABC RESULTS:   sky130_fd_sc_hd__mux4_2 cells:      640
ABC RESULTS:   sky130_fd_sc_hd__mux2_2 cells:     1056
ABC RESULTS:        internal signals:     2005
ABC RESULTS:           input signals:     1072
ABC RESULTS:          output signals:     1088
Removing temp directory.

yosys> clean -purge
Removed 0 unused cells and 4165 unused wires.

yosys> setundef -zero

19. Executing SETUNDEF pass (replace undef values with defined constants).

yosys> splitnets

20. Executing SPLITNETS pass (splitting up multi-bit signals).

yosys> clean -purge

yosys> hilomap -singleton -locell sky130_fd_sc_hd__conb_1 LO -hicell sky130_fd_sc_hd__conb_1 HI

21. Executing HILOMAP pass (mapping to constant drivers).

yosys> insbuf -buf sky130_fd_sc_hd__buf_4 A X

22. Executing INSBUF pass (insert buffer cells for connected wires).

yosys> clean -purge

yosys> echo off
echo off
{
   "creator": "Yosys 0.30+48 (git sha1 14d50a176, clang 10.0.0-4ubuntu1 -fPIC -Os)",
   "invocation": "stat -json -top Register_File -liberty /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_dff_library.lib -liberty /nfs/sc_compute/3b7dc5bf55ae47fabd82eb76eb4e9f2c/Register_File/job0/syn/0/inputs/sc_logiclib_sky130hd.lib ",
   "modules": {
      "\\Register_File": {
         "num_wires":         3153,
         "num_wire_bits":     3258,
         "num_pub_wires":     1098,
         "num_pub_wire_bits": 1203,
         "num_memories":      0,
         "num_memory_bits":   0,
         "num_processes":     0,
         "num_cells":         3207,
         "area":              49789.001600,
         "num_cells_by_type": {
            "sky130_fd_sc_hd__and2_0": 1,
            "sky130_fd_sc_hd__and3b_1": 2,
            "sky130_fd_sc_hd__buf_1": 49,
            "sky130_fd_sc_hd__clkbuf_1": 326,
            "sky130_fd_sc_hd__dfxtp_1": 1088,
            "sky130_fd_sc_hd__mux2_2": 1056,
            "sky130_fd_sc_hd__mux4_2": 640,
            "sky130_fd_sc_hd__nand2_1": 6,
            "sky130_fd_sc_hd__nand2b_1": 1,
            "sky130_fd_sc_hd__nand3_1": 1,
            "sky130_fd_sc_hd__nand3b_1": 5,
            "sky130_fd_sc_hd__nand4_1": 8,
            "sky130_fd_sc_hd__nand4b_1": 3,
            "sky130_fd_sc_hd__nand4bb_1": 3,
            "sky130_fd_sc_hd__nor2_1": 11,
            "sky130_fd_sc_hd__nor3_1": 1,
            "sky130_fd_sc_hd__nor3b_1": 5,
            "sky130_fd_sc_hd__or3_1": 1
         }
      }
   },
      "design": {
         "num_wires":         3153,
         "num_wire_bits":     3258,
         "num_pub_wires":     1098,
         "num_pub_wire_bits": 1203,
         "num_memories":      0,
         "num_memory_bits":   0,
         "num_processes":     0,
         "num_cells":         3207,
         "area":              49789.001600,
         "num_cells_by_type": {
            "sky130_fd_sc_hd__and2_0": 1,
            "sky130_fd_sc_hd__and3b_1": 2,
            "sky130_fd_sc_hd__buf_1": 49,
            "sky130_fd_sc_hd__clkbuf_1": 326,
            "sky130_fd_sc_hd__dfxtp_1": 1088,
            "sky130_fd_sc_hd__mux2_2": 1056,
            "sky130_fd_sc_hd__mux4_2": 640,
            "sky130_fd_sc_hd__nand2_1": 6,
            "sky130_fd_sc_hd__nand2b_1": 1,
            "sky130_fd_sc_hd__nand3_1": 1,
            "sky130_fd_sc_hd__nand3b_1": 5,
            "sky130_fd_sc_hd__nand4_1": 8,
            "sky130_fd_sc_hd__nand4b_1": 3,
            "sky130_fd_sc_hd__nand4bb_1": 3,
            "sky130_fd_sc_hd__nor2_1": 11,
            "sky130_fd_sc_hd__nor3_1": 1,
            "sky130_fd_sc_hd__nor3b_1": 5,
            "sky130_fd_sc_hd__or3_1": 1
         }
      }
}

echo on

yosys> write_verilog -noattr -noexpr -nohex -nodec outputs/Register_File.vg

23. Executing Verilog backend.

yosys> clean_zerowidth
Dumping module `\Register_File'.

Warnings: 28 unique messages, 236 total
End of script. Logfile hash: a94ba3bb17, CPU: user 2.55s system 0.05s, MEM: 121.72 MB peak
Yosys 0.30+48 (git sha1 14d50a176, clang 10.0.0-4ubuntu1 -fPIC -Os)
Time spent: 44% 2x abc (1 sec), 9% 2x write_verilog (0 sec), ...
